In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [4]:
rds_connection_string = "postgres:4902@localhost:5432/education_taxes_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [5]:
pd.read_sql_query('select * from k12grades', con=engine).head()

  START_GRADE END_GRADE  DISTRICT_ID
0          07        12      1800006
1          PK        05      1808190
2          PK        05      1807650
3          06        08      1801020
4          KG        05      1806030

In [ ]:
pd.read_sql_query('select ')